app/Controllers/Staff.php

    public function index()
    {
        if(!session('id'))
        {
            return redirect()->to(base_url())->with('error','Anda Harus Login');
        }

        $data = array(
            'staff' => $this->staffmodel->findAll(),
        );
---
SELECT *
FROM `staff`
WHERE `staff`.`deleted_at` IS NULL

            return redirect()->to('staff-add')->withInput();
        }

            $this->staffmodel->save([
                'name' => $post['name'],
                'email' => $post['email'],
                'password' => md5($post['password']),
            ]);
---
INSERT INTO `staff` (`name`, `email`, `password`, `created_at`, `updated_at`) VALUES ('User2', 'user2@gmail.com', '36f17c3939ac3e7b2fc9396fa8e953ea', '2023-05-12 11:19:31', '2023-05-12 11:19:31')